Repository: eunhyekoo/glo_project
Catalog: feedback/TMData/[Naver] WEBTOON LATAM_Seven Years Later.tmx
Source language: en
Languages: es_419

source: see? we're the same age.
es_419: ¿Ves? Tenemos la misma edad.

source: Wanna eat something?
es_419: ¿Quieres comer algo?

source: when you went missing...
es_419: cuando desapareciste…

source: Maybe it's just a coincidence.
es_419: Quizás solo sea una coincidencia.

source: you're so whipped!
es_419: ¡Qué complaciente!

source: you’re definitely a genius!
es_419: ¡No cabe duda de que eres un genio!

source: We're going to Bali right now.
es_419: Nos vamos a Bali ahora mismo.

source: looks so scary when she's angry with my dad.
es_419: se ve tan aterradora cuando se enoja con mi papá.

source: Okay, that'll be seven cups.
es_419: Bueno, pero que sean siete tazas.

source: HAHAHA.
es_419: JA, JA, JA.

source: maybe this isn't the right pose.
es_419: Tal vez la postura está mal.

source: Just look at the fridge, packed with the magnets from Australia.
es_419: ¿Viste la heladera? Está llena de imanes de Australia.

source: how long are you going to stand there?
es_419: ¿Por cuánto tiempo piensas estar ahí parado?

source: Read 9:02 PM
es_419: Leído 9:02 p. m.

source: Who are you really?
es_419: ¿Quién eres?

source: Dad's still angry with me?
es_419: ¿Papá sigue enojado conmigo?

source: working or college?
es_419: ¿Trabajas o estudias?

source: I'll explain everything to you once I get home.
es_419: Te lo explicaré todo cuando llegue a casa.

source: do you remember the moment when I hid my lip stain from the school counselor?
es_419: ¿Recuerdas cuando tuve que esconder mi labial del consejero de la escuela?

source: that sounds scary...
es_419: Suena aterrador.

source: ...and the last time she left, she went missing.
es_419: Y la última vez que se fue de viaje, desapareció.

source: I think it's best for me to just keep watching K-dramas...
es_419: Creo que lo mejor para mí es seguir mirando series…

source: I'll tell you when I'm ready.
es_419: Te lo diré cuando esté listo.

source: ...how do you enjoy going out with me now?
es_419: … ¿Te gusta salir conmigo?

source: English?!
es_419: ¡¿Habla inglés?!

source: Mom...?
es_419: ¿Mamá?

source: I would invest in botcoin for sure!
es_419: ¡Compraría bitcoins, obvio!

source: sure...
es_419: Bueno…

source: he does have a point.
es_419: Tiene sentido.

source: And I hate it when you drink, Lenca.
es_419: Y no me gusta que bebas, Lenca.

source: Are you Kala Maharani?
es_419: ¿Eres Kala Maharani?

source: (actually just said some numbers and doesn't know the answer)
es_419: (En realidad dije números al azar. No sé cuál es la respuesta)

source: I left her for a second, and when I came back, I found her unconscious.
es_419: La dejé sola un segundo y, cuando volví, se había desmayado.

source: SHAAA
es_419: FSHHH

source: about dad coming to Bali...
es_419: Cuando papá fue a Bali…

source: ...if I take you to Lembang?
es_419: … ir a Lembang conmigo?

source: I can see the wrinkles on her face.
es_419: Puedo ver las arrugas que tiene en la cara.

source: because he was afraid I would disappear again.
es_419: Tenía miedo de que desapareciera de nuevo.

source: SCROLL
es_419: DESLIZA

source: she's just gotten home...
es_419: Acaba de llegar a casa.

source: Fine!
es_419: ¡Bien!

source: if what Ezra said was true...
es_419: Si lo que dijo es cierto…

source: I will--
es_419: Te…

source: By the way, is this a smoking area?
es_419: Por cierto, ¿estamos en la zona de fumadores?

source: But I'm not wet at all...
es_419: Pero no me mojé ni un poco.

source: HAAH!
es_419: ¡AAAH!

source: are two different things.
es_419: son dos cosas diferentes.

source: never mind.
es_419: No importa.

source: I'm just making sure your head is okay.
es_419: Solo me aseguro de que no te hayas golpeado la cabeza.

source: Have you found them?
es_419: ¿Ya los encontraste?

source: maybe I should make a list.
es_419: Quizás deba hacer una lista.

source: are you okay?
es_419: ¿Tú estás bien?

source: If I may ask, are you Balinese, or where are you from?
es_419: Si me permites la pregunta, ¿eres de Bali? ¿O de dónde vienes?

source: YOU KNOW NOTHING, KALA
es_419: NO SABES NADA, KALA

source: it's 220, 898, 482 second.
es_419: Son 220 898 482 segundos.

source: forget it!
es_419: ¡Olvídalo!

source: You're alive.
es_419: Estás viva.

source: ...so that you won't travel back to the past.
es_419: para que no viajes al pasado de nuevo.

source: my hands are still shaking.
es_419: Todavía me tiemblan las manos.

source: (almost drowned)
es_419: (casi se ahoga)

source: ...things must've changed throughout those years.
es_419: … Las cosas deben haber cambiado mucho en ese tiempo.

source: That day went as normal...
es_419: Ese día transcurrió con normalidad…

source: and alter the timeline just like in the movies.
es_419: Y alterar la línea temporal como en las películas.

source: what's so funny...?
es_419: ¿De qué se ríe?

source: Dad will scold me...
es_419: Papá me va a regañar.

source: He never asked for anything in return.
es_419: Y él nunca pidió nada a cambio.

source: SEVEN YEARS LATER
es_419: SIETE AÑOS DESPUÉS

source: ...I noticed someone standing behind her.
es_419: me di cuenta de que había alguien detrás de ella.

source: I thought he was seeing another girl, but that wasn’t the case!
es_419: Creí que estaba saliendo con otra chica, ¡pero parece que no!

source: HAPPY NEW ERA!
es_419: ¡FELIZ NUEVA ERA!

source: I'm sure he knows what we should do.
es_419: Seguro sabe lo que tenemos que hacer.

source: Help her with her homework.
es_419: Ayúdala con su tarea.

source: I'm sure she's really worried about you.
es_419: Seguro está muy preocupada por ti.

source: Why are you crying, Mom?
es_419: ¿Por qué lloras, mamá?

source: wait, what bracelet are you talking about?
es_419: Espera. ¿De qué brazalete estás hablando?

source: ...Where exactly did you see your dad last?
es_419: ¿Cuándo fue la última vez que viste a tu papá?

source: the man who was crushed by the wood...
es_419: El señor que estaba debajo de la madera

source: No, she's my friend.
es_419: No, es mi amiga.

source: since when did dad let you have a cat?!
es_419: ¡¿Desde cuándo papá te deja tener un gato?!

source: don't tell me she...
es_419: No me digas que ella…

source: she was the girl I thought was dead.
es_419: Es la chica que pensé que había muerto.

source: it makes me nervous.
es_419: Estoy nerviosa.

source: SMACK
es_419: PAM

source: I'll play upstairs, pushing rank as usual.
es_419: Me voy arriba a jugar para subir de rango.

source: When I come home later,
es_419: Cuando vuelva a casa,

source: about the fire...
es_419: El incendio…

source: HOME SWEET HOME
es_419: HOGAR, DULCE HOGAR

source: I know that you guys have been engaged.
es_419: Sé que los dos están comprometidos.

source: I envy him...
es_419: Cómo lo envidio…

source: hey...
es_419: Ey,

source: Umm...
es_419: Hum…

source: change it!
es_419: ¡Cámbialo!

source: that's what she said.
es_419: Eso fue lo que dijo.

source: You look exactly the same like seven years ago!
es_419: ¡Estás igual que hace siete años!

source: after having a vacation in australia with others, I did plan to go home to bandung.
es_419: Después de las vacaciones en Australia con los chicos, decidí volver a casa, a Bandung.

source: I always asked him to teach me to ride a motorbike...
es_419: Siempre le pedí que me enseñara a andar en motocicleta…

source: What, why are you crying?
es_419: ¿Eh? ¿Por qué lloras?

source: Art by
es_419: Arte de

source: let's find your mom.
es_419: deberíamos buscar a tu mamá.

source: He was the smartest one in our class.
es_419: Era el chico más inteligente de la clase.

source: Are you really Kala?!
es_419: ¡¿De verdad eres Kala?!

source: I'm sorry, but he said no.
es_419: Perdón, pero me dijo que no.

source: TAARA (ARA) KALA'S LiTTLE SISTER 10 years old
es_419: TAARA (ARA) HERMANA MENOR DE KALA 10 años

source: alright, let's go.
es_419: Bien, vamos.

source: CHAPTER 16:
es_419: CAPÍTULO 16:

source: I'll treat you to a meal or anything.
es_419: Te invito a cenar o a lo que quieras.

source: gavin showed me yesterday.
es_419: Gavin me los mostró ayer.

source: kids these days can't live without their phones.
es_419: Los jóvenes de ahora no pueden vivir sin sus teléfonos.

source: b-but, mom...
es_419: Pe-pero mamá…

source: but how did ezra get the same bracelet?
es_419: ¿Pero por qué Ezra tiene uno igual?

source: many people leave their comments and messages on my account.
es_419: Muchos de ustedes me enviaron comentarios y mensajes.

source: How did you get in?
es_419: ¿Cómo entraste?

source: I didn't know they were looking for me...
es_419: No sabía que me estaban buscando…

source: are you going to bandung too?
es_419: ¿También vas para Bandung?

source: Of course it is!
es_419: ¡Claro que no!

source: if only I could...
es_419: Si tan solo pudiera…

source: Perhaps, she hurt her head and had a concussion
es_419: Quizás se golpeó la cabeza y tuvo una contusión

source: ...Until I realized he wore something I never saw before.
es_419: … hasta que me di cuenta de que llevaba puesto algo que nunca había visto.

source: is dad still angry with me?
es_419: ¿Seguirá enojado conmigo?

source: haha
es_419: Jaja

source: There you go again with your science lessons, genius...
es_419: Ya arrancaste con tus cursos de ciencia, cerebrito.

source: I wonder how many seconds there are in seven years.
es_419: me pregunto cuántos segundos habrá en siete años…

source: not that much.
es_419: No mucho.

source: slowly, sir...
es_419: Despacio, señor

source: TREMBLE
es_419: BRRR

source: We have two hours until your mom gets here,
es_419: Tenemos dos horas hasta que llegue tu mamá.

source: This morning, we're going to some places near Kuta.
es_419: Esta mañana, vamos a recorrer lugares cerca de Kuta.

source: But who?
es_419: ¿Quién era?

source: (why am I asking this.)
es_419: (¿Por qué le pregunté eso?)

source: beep
es_419: BIP

source: one...
es_419: Uno…

source: Slim and touch-sensitive...
es_419: Delgado y táctil…

source: Y-Yes???
es_419: ¿¿S-sí??

source: I'll be too worried if there's no one watching her--
es_419: Me voy a preocupar mucho si nadie la vigila…

source: what made me sad wasn't the fact that she dropped out.
es_419: No me entristece el hecho de que abandonara…

source: I'm head over heels for gavin. once I travel back to 2013, I will find him no matter what!
es_419: Estoy loca por Gavin. Cuando regrese al 2013, ¡lo voy a encontrar como sea!

source: ...You knew my grandma was gone!
es_419: ¡Sabías que mi abuela se había ido!

source: she's...
es_419: Ella…

source: H-Help!
es_419: ¡A-ayuda!

source: unless...
es_419: A menos que…

source: the next day.
es_419: Al día siguiente.

source: Oh...
es_419: Ah…

source: 4:15 PM PM
es_419: 4:15 p. m.

source: ...I'll always feel guilty.
es_419: … me sentiré siempre culpable.

source: look, we wear the same bracelets!
es_419: ¡Y mira! ¡Yo tengo el mismo!

source: what?!
es_419: ¡¿Qué?!

source: and don't disappear again.
es_419: Y no vuelvas a desaparecer.

source: Whenever I got my report card, I wished I were Ezra.
es_419: Cada vez que recibía mis calificaciones, deseaba ser como Ezra.

source: but after you've said that...
es_419: Pero después de que dijiste eso,

source: ...he refused to talk to me.
es_419: … se negó a hablar conmigo.

source: huh, you guys are done already?
es_419: ¿Eh? ¿Ya terminaron?

source: and you, gavin...
es_419: Y tú, Gavin…

source: ezra said I'm a time traveler.
es_419: Ezra me dijo que puedo viajar en el tiempo.

source: and also even though i havent seen my dad for seven years...
es_419: Y a pesar de no haber visto a mi padre por siete años…

source: I can't help it...
es_419: No puedo evitarlo…

source: couldn't you have knocked first?!
es_419: Podrías haber tocado primero, ¿no?

source: Go take a shower.
es_419: Ve a darte una ducha,

source: I think...
es_419: Creo que,

source: what happened?!
es_419: ¡¿Qué pasó?!

source: He's in Jakarta.
es_419: Está en Yakarta.

source: time traveler, my as*!
es_419: ¡Viajes en el tiempo, mis polainas!

source: We all always copied his answers to our answer sheets.
es_419: Siempre nos copiábamos de sus respuestas en los exámenes.

source: Ouch, my hand hurts, too.
es_419: ¡Ay! También me dolió.

source: Wait, Kala!!!
es_419: ¡¡Kala, espera!!

source: Who told you?
es_419: ¿Quién te lo dijo?

source: kala disappeared again!
es_419: ¡Kala volvió a desaparecer!

source: I'm in the future now!
es_419: ¡que estoy en el futuro!

source: she may not remember.
es_419: Quizás no lo recuerde.

source: and now he's asking if I'm still up?!
es_419: ¡¿Y ahora me pregunta si sigo despierta?!

source: stop patting my head, I'm gonna cry even harder if you keep doing that.
es_419: Deja de acariciarme la cabeza. Me vas a hacer llorar más si sigues haciéndolo.

source: seriously--!
es_419: ¡En serio…!

source: ...but she vanished into thin air.
es_419: y se esfumó en el aire.

source: I didn't get wet, but it seems like my phone didn’t survive.
es_419: No me mojé, pero parece que mi teléfono no sobrevivió.

source: A MISSING GIRL
es_419: UNA CHICA PERDIDA

source: why are you hiding?
es_419: ¿Por qué te escondes?

source: I came here unnoticed.
es_419: No me vieron entrar.

source: we were all worried about you.
es_419: estábamos muy preocupados por ti.

source: You said she misses me?!!!
es_419: ¡¿Dijiste que me extrañaba?!

source: D-Dad?!
es_419: ¿P-papá?

source: FWIP
es_419: FUIP

source: you've watched too many movies, ezra.
es_419: Viste demasiadas películas, Ezra.

source: hahahaha.
es_419: Ja, ja, ja, ja.

source: I just passed seven years within a second.
es_419: Acabo de vivir siete años en un segundo.

source: no fire, nobody's running around.
es_419: No hay fuego, ni nadie tratando de escapar.

source: and the last person she saw was...
es_419: La última persona que vio…

source: But you know my dad forbid me to go...
es_419: Pero ya sabes que mi papá me prohibió ir.

source: Y-you know...
es_419: Es que…

source: mom is really worried...
es_419: Mamá está muy preocupada.

source: who are you?!
es_419: ¡¿Quién eres?!

source: TRAUMATIZED
es_419: TRAUMADO

source: FWOOOSH
es_419: FUUUSH

source: I went there with my classmates...
es_419: Fui con mis compañeros…

source: yeah, maybe makeup is her element after all.
es_419: Sí, quizás el maquillaje sea lo suyo.

source: Dad must have gotten angry about this situation.
es_419: Seguro papá está muy enojado,

source: And swimming at the beach is one of her plans.
es_419: Llevarme a nadar a la playa es uno de ellos.

source: You'll age faster if you keep making that face.
es_419: Vas a envejecer muy rápido si sigues poniendo esa cara.

source: but I saw it with my own eyes.
es_419: pero lo vi con mis propios ojos.

source: how does it feel now that you and your little sister are the same age?
es_419: ¿Cómo te sientes ahora que tienes la misma edad que tu hermana?

source: double kill!
es_419: ¡Asesinato doble!

source: but who would have thought that...
es_419: Pero quién hubiera imaginado…

source: Well, it's easier said than done.
es_419: Bueno, es más fácil decirlo que hacerlo.

source: he's changed a lot!
es_419: ¡Cambió muchísimo!

source: I'm nervous.
es_419: Qué nervios.

source: ...to learn that I didn't get to see grandma before she was gone.
es_419: Me enteré de que no pude ver a la abuela antes de que se fuera.

source: now I have a friend at home.
es_419: tener una amiga en casa.

source: grandma...
es_419: Abuela…

source: but now you're busy with another girl.
es_419: pero ahora estás ocupado con otra chica.

source: Whenever she makes a mistake, I take the fall.
es_419: Cada vez que ella hace algo mal, me echa la culpa a mí.

source: ...wanna talk to dad?
es_419: … ¿Quieres hablar con papá?

source: this cat has been in this house longer than you.
es_419: Este gato lleva en esta casa más tiempo que tú.

source: but then we got along well immediately.
es_419: pero enseguida nos llevamos bien.

source: Among the members of my family,
es_419: De todos los miembros de la familia,

source: my treat!
es_419: ¡Yo invito!

source: You kept bringing up Ara again and again, but... have you ever thought about how I felt?!
es_419: Y siempre metes a Ara en esto pero… ¿nunca te preguntaste cómo me sentía?

source: I was answering a call.
es_419: Estaba atendiendo una llamada.

source: hMm?
es_419: ¿Sí?

source: CHAPTER 19 :
es_419: CAPÍTULO 19:

source: Just once, please!
es_419: ¡Solo una vez, porfa!

source: don't ever travel back to the past until I finish writing my bucket list...
es_419: No viajes al pasado hasta que termine de escribir mi lista de deseos…

source: ingrid has a bunch of plans to show me around Bali.
es_419: Ingrid ideó un montón de planes para mostrarme Bali.

source: Something feels off today!
es_419: ¡Siento que algo no va bien!

source: but I need to go back before my dad gets worked up.
es_419: pero tengo que volver con mi papá antes de que se ponga nervioso.

source: I used to have cute cheeks and hair like yours.
es_419: Solía tener mejillas suaves y el cabello como el tuyo.

source: Don't stay up late.
es_419: No te quedes hasta tarde.

source: I feel relieved...
es_419: siento un gran alivio.

source: it means Ara now is as old as me...
es_419: Significa que Ara ahora tiene mi edad.

source: Yeah, but Dad won't let me.
es_419: Sí, pero papá no me deja.

source: okay.
es_419: Listo.

source: Then are you in college now?
es_419: Entonces estás en la universidad, ¿no?

source: it means...
es_419: … eso significa…

source: Your friend from earlier...
es_419: Tu amiga de antes,

source: Ezra and your boyfriend went all the way to remote places just to look for you.
es_419: Ezra y tu novio fueron hasta lugares muy lejanos intentando encontrarte.

source: d-dad?!
es_419: ¿P-papá?

source: I hear her voice!
es_419: ¡Oigo su voz!

source: a friend...
es_419: Una amiga…

source: hmm...
es_419: Mmm…

source: put this on.
es_419: Ponte esto.

source: TCK
es_419: TCH

source: SLAP
es_419: PAF

source: Grandma...
es_419: Abuela…

source: CHAPTER 7:
es_419: CAPÍTULO 7:

source: I hope you don't judge me like other people.
es_419: Espero que no me juzgues como los demás.

source: My heart is racing like crazy!
es_419: ¡Se me alborota el corazón!

source: He... must've met someone new, right?
es_419: Él… ya conoció a otra persona, ¿no es así?

source: But something came up in my mind.
es_419: Pero se me pasó algo por la cabeza.

source: the woman in front of me is... grandma?!
es_419: La mujer que tengo enfrente es… ¿mi abuela?

source: that's why I always pray whenever I walk by here.
es_419: Y por eso siempre rezo cada vez que paso por este lugar.

source: There's something called a rip current, and it might pull you away from the shore.
es_419: Hay algo que se llama "corriente de retorno", y esto podría alejarlas de la orilla.

source: He works in Jakarta now.
es_419: Ahora trabaja en Yakarta.

source: we can say this place took the same concept like the one in paris.
es_419: Podríamos decir que este lugar tiene un concepto similar al de París.

source: can't come home yet.
es_419: no puede volver a casa aún.

source: SUKMA KALA'S GRANDMA
es_419: SUKMA ABUELA DE KALA

source: I should think more about...
es_419: debería pensar más en…

source: you were chubby before.
es_419: antes eras regordete.

source: Lenca, please examine her.
es_419: Lenca, revísala, por favor.

source: seven years...
es_419: Siete años…

source: but still, you're the second smartest in our class.
es_419: Eres la segunda más inteligente de la clase.

source: and still remembered exactly what happened.
es_419: … y recordaba con exactitud lo que había pasado.

source: Just sleep.
es_419: Ve a dormir.

source: Maybe he didn't realize we have these.
es_419: Quizás no sabe que tenemos los mismos.

source: ...dad?
es_419: … ¿Papá?

source: I guess what you said was right...
es_419: Creo que lo que dijiste antes es verdad…

source: I lost consciousness when I was thinking about...
es_419: Perdí el conocimiento cuando pensaba…

source: CHAPTER 15:
es_419: CAPÍTULO 15:

source: tiptoeing
es_419: de puntillas

source: Correct?
es_419: ¿Es correcto?

source: K-dramas!!!
es_419: ¡¡Las series!!

source: you traveled to the year 2003...
es_419: Viajaste al año 2003,

source: What about boba for two days?
es_419: ¿Y qué tal por dos días?

source: GIGGLE I'll make it quick.
es_419: JIJI. Termino rapidito.

source: and second, I wanna play games.
es_419: Y, segundo, quiero jugar videojuegos.

source: ...become a medical student, or even become a resident in a hospital!
es_419: Y debería estar estudiando medicina, o incluso ser residente en algún hospital.

source: ...because he knew your selfish decisions could make me disappear again.
es_419: … porque sabía que podía desaparecer otra vez por sus decisiones egoístas.

source: Can we just pinch each other?!
es_419: ¡¿Podemos pellizcarnos?!

source: ...Maybe this is karma...
es_419: Tal vez esto sea el karma…

source: and I'll try to explain to him.
es_419: y voy a tratar de explicarle lo que pasó.

source: HIS REGRETS
es_419: AHOGADO EN PENAS

source: are you really her? my best friend from high school?
es_419: ¿De verdad eres tú? ¿Mi mejor amiga de la secundaria?

source: this story reminds me of...
es_419: Esta historia me recuerda al…

source: *when the police can't find a missing person for more than five years, they'll conclude that that person is unlikely to survive.
es_419: *Cuando la policía no logra encontrar a una persona desaparecida por más de cinco años, concluye que es poco probable que esté viva.

source: I'll get you a towel.
es_419: Te voy a traer una toalla.

source: You know how my dad is, right?
es_419: Ya sabes cómo es mi papá, ¿no?

source: since you said you want them, I want them, too!
es_419: Desde que dijiste que los querías. ¡Entonces yo también!

source: how dare you!
es_419: ¡Cómo te atreves!

source: I just had a shower!
es_419: ¡Acabo de bañarme!

source: I want to hang out with my friends the way an average teen would do!
es_419: Quiero salir con mis amigos como cualquier adolescente normal.

source: How about Grandma?
es_419: ¿Y la abuela?

source: UGHH
es_419: AAGH

source: and one tapioca lemon tea! gavin, what will you have?
es_419: ¡Y un té de limón y tapioca! ¿Gavin, tú qué vas a pedir?

source: does he hate me that much that he won't see his daughter who went missing for seven years?
es_419: ¿Me odia tanto como para no querer ver a su hija desaparecida después de siete años?

source: Ah, it's nothing
es_419: Ay, no es nada

source: I can barely taste this food.
es_419: Apenas puedo saborear la comida.

source: looks like mom tidies it up every day.
es_419: Parece que mamá la ordena todos los días.

source: ...seven years is not a short time!
es_419: ¡siete años es mucho tiempo!

source: He said he's coming back tomorrow.
es_419: Me dijo que vuelve mañana.

source: how long are you going to rest here?
es_419: ¿Cuánto tiempo más piensas estar ahí?

source: Right, you should eat.
es_419: Bueno, deberías comer algo.

source: huff!
es_419: ¡Uff!

source: No, i'm not a kid!
es_419: No, ya no soy una niña!

source: this explains why you're still 17 even though seven years have passed.
es_419: Eso explica por qué sigues teniendo 17 años aunque hayan pasado siete.

source: I remembered one or two years ago...
es_419: Me acuerdo que hace uno o dos años…

source: Whenever she makes a mistake, he calls me a "bad sister."
es_419: Cada vez que ella hace algo mal, yo soy "una mala hermana".

source: HMM
es_419: MMM

source: (The people who missed Ezra.)
es_419: (Los que extrañaban a Ezra).

source: Makes sense that you're seeing a foreigner, Ezra!
es_419: ¡Tiene sentido que salgas con una extranjera, Ezra!

source: ...because of this girl.
es_419: … Es esta chica.
